# Вот вам текст:
# «Ну, вышел я, короче, из подъезда. В общем, короче говоря, шел я, кажется, в магазин.
# Ну,эээ, в общем, было лето, кажется. Как бы тепло. Солнечно, короче. Иду я, иду, в общем,
# по улице, а тут, короче, яма. Я, эээээ…. Упал в нее. И снова вышел, короче, из подъезда.
# Ясен пень, в магазин. В общем, лето на дворе, жарко, солнечно, птицы, короче, летают. Кстати,
# иду я по улице, иду, а тут, короче, яма. Ну, я в нее упал, в общем. Вышел из подъезда, короче.
# Лето на дворе, ясен пень. Птицы поют, короче, солнечно. В общем, в магазин мне надо.
# Что-то явно не так, короче. «Рекурсия», - подумал я. Ээээ...короче, в общем, пошел другой
# дорогой и не упал в эту… ээээ… яму. Хлеба купил».

# Отфильтруйте его, чтобы этот текст можно было нормально прочесть.
# Предусмотрите вариант, что мусорные слова могли быть написаны без использования запятых.


def delete_filler_words(text, words):
    text = list((text.lower()).split('.'))
    result = ''
    for i in text:
        for j in words:
            i = i.replace(', '+ j + ', ', ' ')
            i = i.replace(j + ', ', '')
            i = i.replace(j + ',', '')
            i = i.replace(', ' + j, '')
            i = i.replace(' ' + j, '')
            i = i.replace(j, '')
            i = i.replace('  ', '')
        result += i[:2].upper() + i[2:] + '.'
    return result


example_text = '«Ну, вышел я, короче, из подъезда. В общем, короче говоря, шел я, кажется, в магазин. \
                Ну,эээ, в общем, было лето, кажется. Как бы тепло. Солнечно, короче. Иду я, иду, в общем, \
                по улице, а тут, короче, яма. Я, эээээ…. Упал в нее. И снова вышел, короче, из подъезда. \
                Ясен пень, в магазин. В общем, лето на дворе, жарко, солнечно, птицы, короче, летают. Кстати, \
                иду я по улице, иду, а тут, короче, яма. Ну, я в нее упал, в общем. Вышел из подъезда, короче. \
                Лето на дворе, ясен пень. Птицы поют, короче, солнечно. В общем, в магазин мне надо. \
                Что-то явно не так, короче. «Рекурсия», - подумал я. Ээээ...короче, в общем, пошел другой \
                дорогой и не упал в эту… ээээ… яму. Хлеба купил».'

filler_words = ['в общем', 'короче говоря', 'ясен пень', 'как бы','кажется','короче', 'кстати', 'эээээ', 'ээээ', 'эээ', 'ну']

print(delete_filler_words(example_text, filler_words))